DataProcessors/ПрайсОтправка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПрайсОтправка</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыХарактеристик</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПрайсОтправка/Ext/ObjectModule.bsl
Процедура СформироватьПрайс (ТабДок,ВыбНоменклатура = "") Экспорт
	 // ТабДок = Новый ТабличныйДокумент;
	  ТабДок.Очистить();
	  
	  Макет = ПолучитьМакет("Макет");
	  
	  ОблСтрока = Макет.ПолучитьОбласть("Строка");
	  ОблШапка = Макет.ПолучитьОбласть("Шапка");
	  ОблГруппа = Макет.ПолучитьОбласть("Группа");
	  ОблНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	  
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК Остаток,
	                 |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                 |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                 |	ТоварыНаСкладахОстатки.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	                 |	ТоварыНаСкладахОстатки.Номенклатура.Родитель КАК Родитель,
	                 |	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК Рез,
	                 |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Ост
	                 |ИЗ
	                 |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                 |			&НаДату,
	                 |			НЕ Номенклатура В ИЕРАРХИИ (&Группа)
	                 |				И НЕ Номенклатура.НеУчатвуетВОтправкеПрайса
	                 |				И (Номенклатура = &Номенклатура
	                 |					ИЛИ &НоменклатураВыбрана)) КАК ТоварыНаСкладахОстатки
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&НаДату, ) КАК ТоварыВРезервеНаСкладахОстатки
	                 |		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	                 |			И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	                 |ГДЕ
	                 |	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ТоварыНаСкладахОстатки.Номенклатура,
	                 |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	                 |	ТоварыНаСкладахОстатки.Номенклатура.НоменклатурнаяГруппа,
	                 |	ТоварыНаСкладахОстатки.Номенклатура.Родитель,
	                 |	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток,
	                 |	ТоварыНаСкладахОстатки.КоличествоОстаток";
	  
	  
	//условия прайса
	Запрос.УстановитьПараметр("Группа",Справочники.Номенклатура.НайтиПоКоду("000000327"));
	Запрос.УстановитьПараметр("НаДату",ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура",ВыбНоменклатура);
	Запрос.УстановитьПараметр("НоменклатураВыбрана",НЕ ЗначениеЗаполнено(ВыбНоменклатура));
					 
	Рез = Запрос.Выполнить().Выгрузить();
	Рез.Сортировать("Номенклатура,ХарактеристикаНоменклатуры");
	
	//распаковка ростовок  //////////////////////////////////////////////////////
	НужноУдалить = Новый Массив;
	ТабХар = Новый ТаблицаЗначений;
	ТабХар.Колонки.Добавить("Характеристика");
	Для Каждого Стр Из Рез Цикл
		//получили ее раньше
		НайденаХарактеристика = ТабХар.Найти(Стр.ХарактеристикаНоменклатуры,"Характеристика");
		Если НайденаХарактеристика = Неопределено Тогда 
			ТабХар = ОбщегоНазначения.ДоступностьХарактеристикиГруппы(Стр.ХарактеристикаНоменклатуры);
		ИначеЕсли НайденаХарактеристика.Доступна Тогда
			Продолжить;
		ИначеЕсли НЕ НайденаХарактеристика.Доступна Тогда
			НужноУдалить.Добавить(Стр);
			Продолжить;
		КонецЕсли;
		
		//не получили и в этот раз
		НайденаХарактеристика = ТабХар.Найти(Стр.ХарактеристикаНоменклатуры,"Характеристика");
		Если НЕ НайденаХарактеристика = Неопределено  Тогда
			Если НЕ НайденаХарактеристика.Доступна Тогда
				НужноУдалить.Добавить(Стр);
			КонецЕсли;
		КонецЕсли;
		
		//проверка вхождения в группу
		ГрХар = Стр.ХарактеристикаНоменклатуры.ПолучитьОбъект().ПолучитьРостовку();
		Если НЕ ЗначениеЗаполнено(ГрХар) Тогда
			НужноУдалить.Добавить(Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из НужноУдалить Цикл // ростовки нельзя распакововать
		Рез.Удалить(Стр);
	КонецЦикла;
	
	ОблШапка.Параметры.Заголовок= "Цены на "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	ТабДок.Вывести(ОблШапка);
	ТабДок.НачатьАвтогруппировкуСтрок();
	Ном = 1;
	
	ВыборкаГрупп = Справочники.Номенклатура.ВыбратьИерархически();
	
	Пока ВыборкаГрупп.Следующий() Цикл
		Если НЕ ВыборкаГрупп.ЭтоГруппа  ИЛИ ВыборкаГрупп.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		Уровень = ВыборкаГрупп.УровеньВВыборке();
		Если НЕ ЕстьНоменклатураГруппыВТЗ(ВыборкаГрупп.Ссылка,Рез) Тогда // проверка отбора номенклатуры
			Продолжить;
		КонецЕсли;
		Если Уровень = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Проб = "";
		ДЛя Сч = 1 По Уровень Цикл
			Проб = Проб+"   ";
		КонецЦикла;
		ОблГруппа.Параметры.Родитель = Проб+ВыборкаГрупп.Наименование;
		ТабДок.Вывести(ОблГруппа,1,"Гр1",Истина);
		
		ОтборПоГРуппе = Рез.НайтиСтроки(Новый Структура("Родитель",ВыборкаГрупп.Ссылка));
		ТабНомГруппы = Рез.Скопировать(ОтборПоГРуппе);
		ТабНомГруппы.Свернуть("Номенклатура");
		ТабНомГруппы.Сортировать("Номенклатура");
		
		Для Каждого Стр Из ТабНомГруппы Цикл
			
			ТабПоНоменклатуреГр = Рез.Скопировать(Рез.НайтиСтроки(Новый Структура("Родитель,Номенклатура",ВыборкаГрупп.Ссылка,Стр.Номенклатура)));
			ОблНоменклатура.Параметры.Родитель = Стр.Номенклатура.Наименование;
			ТабДок.Вывести(ОблНоменклатура,2,"Гр2",Истина); 
			Если ЗначениеЗаполнено(Стр.Номенклатура.ДополнительноеОписаниеНоменклатуры1) Тогда
				ОблГруппа.Параметры.Родитель = Стр.Номенклатура.ДополнительноеОписаниеНоменклатуры1;
				ТабДок.Вывести(ОблГруппа,3,"Гр3",Истина);
			КонецЕсли;


			Для Каждого Стр1 Из ТабПоНоменклатуреГр Цикл
				
				ТипИзделия  = ОбщегоНазначения.СвойстваОбъекта(Стр1.Номенклатура,"000000037");
			
				ОблСтрока.Параметры.Номенклатура = Стр1.ХарактеристикаНоменклатуры.Наименование+Символы.ПС+ТипИзделия;
				
				ЦенаПрод =  Ценообразование.ПолучитьЦенуНоменклатуры(Стр1.Номенклатура,Стр1.ХарактеристикаНоменклатуры,Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000011"),ТекущаяДата());
				ЦенаПрод1 =  Ценообразование.ПолучитьЦенуНоменклатуры(Стр1.Номенклатура,Стр1.ХарактеристикаНоменклатуры,Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000002"),ТекущаяДата());
				
				//скидка
				ПроцСкидки = ОбщегоНазначения.АвтомСкидка(Стр1.ХарактеристикаНоменклатуры);
				Если ПроцСкидки>0 Тогда
					ЦенаПрод = ЦенаПрод *(1-ПроцСкидки/100);
					ЦенаПрод1 = ЦенаПрод1 *(1-ПроцСкидки/100);
				КонецЕсли;
				
				//ЦенаПрод =  ЦенаПродажная(Стр1.Номенклатура,Стр1.ХарактеристикаНоменклатуры,Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000011"));
				ОблСтрока.Параметры.Цена = ЦенаПрод;
				ОблСтрока.Параметры.Цена1 = ЦенаПрод1;
				
				ОблСтрока.Параметры.Штрихкод = ШтрихкодНоменклатуры(Стр1.Номенклатура,Стр1.ХарактеристикаНоменклатуры);
				
				ОблСтрока.Параметры.Замеры  = ОбщегоНазначения.ЗамерыПолучить(Стр1.Номенклатура,Стр1.ХарактеристикаНоменклатуры);
				
				//фото
				СпрГруппыЦветов = ОбщегоНазначения.ГруппаЦветовХарактеристики(Стр1.Номенклатура,Стр1.ХарактеристикаНоменклатуры);
				Фото = "";
				Если ЗначениеЗаполнено(СпрГруппыЦветов) Тогда
					ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(СпрГруппыЦветов);
					
					Для Каждого Фот Из ТабФото Цикл
					    ИмяФото = Фот.Наименование;   
						Фото = Фото+"http://cvetkovtm.com/assets/shop/sync/imgJpg/"+ИмяФото+Символы.ПС;
					КонецЦикла;
					ОблСтрока.Параметры.Фото = Фото;
				Иначе
					ОблСтрока.Параметры.Фото = "";
				КонецЕсли;
				
				
				ЦветХарактеристики = ЦветХарактеристики(Стр1.ХарактеристикаНоменклатуры);
				РЖБ = РЖБЦвета(ЦветХарактеристики); 
				ОблСтрока.Параметры.Цвет = РЖБ;
				Попытка
					СоставныеЦвета  = ОбщегоНазначения.СоставныеПоРазделителю(РЖБ,",");
					Цвет = Новый Цвет(СоставныеЦвета[0].Значение,СоставныеЦвета[1].Значение,СоставныеЦвета[2].Значение);
					ОблСтрока.Области.Цвет.ЦветФона = Цвет;
				Исключение
					ОблСтрока.Области.Цвет.ЦветФона = Новый Цвет(255,255,255);
				КонецПопытки;
				Ном = Ном+1;
				ТабДок.Вывести(ОблСтрока,3,"Гр3",Истина);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Автомасштаб = Истина; 
	ТабДок.ФиксацияСверху = 4;
	ТабДок.ФиксацияСлева = 1;
	
КонецПроцедуры

Функция ЦветХарактеристики(Характеристика)
	ЗапросЦветРазмер = Новый Запрос;
	
	ЗапросЦветРазмер.Текст = "ВЫБРАТЬ
	                         |	ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	                         |	ЗначенияСвойствОбъектов.Значение КАК Значение
	                         |ИЗ
	                         |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                         |ГДЕ
	                         |	ЗначенияСвойствОбъектов.Объект = &Объект
	                         |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	СвойствоЦвет = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000069");
	ЗапросЦветРазмер.УстановитьПараметр("Объект",Характеристика);
	ЗапросЦветРазмер.УстановитьПараметр("Свойство",СвойствоЦвет);
	
	ВыборкаЦветРазмер = ЗапросЦветРазмер.Выполнить().Выбрать();
	
	Если  ВыборкаЦветРазмер.Следующий() Тогда
		Возврат ВыборкаЦветРазмер.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция РЖБЦвета(Цвет)
	RGB = "";
	Попытка
		Если  Цвет.ТипЦвета1 = "RAL" ИЛИ  Цвет.ТипЦвета1 = "" Тогда
			Если ЗначениеЗаполнено(Цвет.Цвет) Тогда
				RGB = Строка(Цвет.Цвет.Red)+","+Строка(Цвет.Цвет.Green)+","+Строка(Цвет.Цвет.Blue);
			КонецЕсли;
		КонецЕсли;
		Если   Цвет.ТипЦвета1 = "RGB" ИЛИ Цвет.ТипЦвета1 = "HEX" Тогда
			Если ЗначениеЗаполнено(Цвет.ЦветRGB) Тогда
				RGB = Строка(Цвет.Красный)+","+Строка(Цвет.Зеленый)+","+Строка(Цвет.Голубой);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат RGB;	
КонецФункции

Функция ЕстьНоменклатураГруппыВТЗ(Группа,ТЗ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
	               |	И НЕ Номенклатура.ЭтоГруппа";
	Запрос.УстановитьПараметр("Группа",Группа);
	Рез = Запрос.Выполнить().Выгрузить();
	
	ЕстьНоменклатура = Ложь;
	Для Каждого Стр Из Рез Цикл
		НайденаВТЗ = ТЗ.Найти(Стр.Номенклатура,"Номенклатура");
		Если Не НайденаВТЗ = Неопределено Тогда
			ЕстьНоменклатура = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьНоменклатура
КонецФункции

Функция ШтрихкодНоменклатуры(Номенклатура,Характеристика) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Штрихкоды.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Владелец = &Владелец
	               |	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	Запрос.УстановитьПараметр("Владелец",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Характеристика);
	
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.Штрихкод;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции


Функция ВисотаШирина(Ном)
	//Ном = Справочники.Номенклатура.СоздатьЭлемент();
	 Опция = ""; 
	 Для Каждого Стр Из Ном.АтрибутыСайта Цикл
		Если СокрЛП(Стр.Атрибут)="Высота" Тогда
				Опция=Опция+ " Выс."+СокрЛП(Стр.Значение)+Символы.ПС;
		КонецЕсли;
		Если СокрЛП(Стр.Атрибут)="Ширина" Тогда
				Опция=Опция+" Шир."+СокрЛП(Стр.Значение)+Символы.ПС;
		КонецЕсли;
		Если СокрЛП(Стр.Атрибут)="Длина" Тогда
				Опция=Опция+ " Дл."+СокрЛП(Стр.Значение)+Символы.ПС;
		КонецЕсли;
		Если СокрЛП(Стр.Атрибут)="Диаметр" Тогда
			Опция=Опция+ " Диам."+СокрЛП(Стр.Значение)+Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	Возврат Опция;
КонецФункции

Функция ОстатокНоменклатуры(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
				   |	ТоварыНаСкладахОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Возврат Рез.Итог("КоличествоОстаток");
	
КонецФункции

Функция КурсВалютыНаДату(Вал,Дат)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Курс
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Валюта",Вал);
	Запрос.УстановитьПараметр("НаДату",Дат);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.Курс;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

Функция ЦенаПрихода(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5
	               |	ПоступлениеТоваровУслугТовары.Цена,
	               |	ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента,
	               |	ПоступлениеТоваровУслугТовары.Ссылка.Дата
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	               |	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПоступлениеТоваровУслугТовары.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Если Рез.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("980") Тогда
			Возврат Рез.Цена;
		Иначе
			Возврат Рез.Цена*КурсВалютыНаДату(Рез.ВалютаДокумента,Рез.Дата);
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ЦенаПродажная(Номенклатура,Характеристика, ТипЦены)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			ТипЦен = &ТипЦен
	               |				И Номенклатура = &Номенклатура
	               |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТипЦен",ТипЦены);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Характеристика);

	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
